Revit 2027 API
RebarShapeDrivenAccessor.BarsOnNormalSide Property
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BarsOnNormalSide { get; set; }
Public Property BarsOnNormalSide As Boolean
	Get
	Set
public:
property bool BarsOnNormalSide {
	bool get ();
	void set (bool value);
}
member BarsOnNormalSide : bool with get, set
Property Value
Boolean
 True if the bars of rebar set are on the same side of the rebar plane indicated by the normal, and false if the bars are on the opposite side.
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace